// Задание 16.

// Заведение "содержит" помещение. Кажется, что заведение "является" помещением,
// но заведение может переехать в другое помещение => отношение has-a (содержит, композиция)

// Вино "содержит" алкоголь. Кажется, что вино "является" алкоголем,
// но сам атрибут "алкоголь" может измениться. Например, увеличиться или уменьшиться в каком-то соотношении.
// => отношение has-a

// Задание 17.

// Яблоко "является" фруктом. Яблоко никак не может "содержать" фрукт => отношение is-a (наследование)

// Глаз "является" органом. Глаз не может "содержать" орган внутри себя
// (тут, конечно, зависит от того, как подходить к понятию "глаз")
